steferic/world-radio/firmware/sdkconfig.defaults
# Give app_main a bit more room; it just brings up Wi-Fi/tasks and returns.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096

# Needed if you ever point STREAM_URL at an https:// source.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y

# LWIP TCP receive window a bit larger helps smooth out jittery HTTP audio.
CONFIG_LWIP_TCP_WND_DEFAULT=5744
CONFIG_LWIP_TCP_RECVMBOX_SIZE=12

# Set Target
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y

# Partition Table
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
CONFIG_PARTITION_TABLE_FILENAME="partitions_singleapp_large.csv"

# 1) Debugging mbedTLS failures
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_ASYMMETRIC_CONTENT_LEN=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=8192
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=2048
CONFIG_HEAP_TASK_TRACKING=y

# 2) Adding PSRAM
CONFIG_SPIRAM=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_MEMTEST=y